Changed UML to use mermaid
