--- a/README.md
+++ b/README.md
@@ -37,24 +37,17 @@ print(response.json())       # Response data
 
 ```
 
-```plantuml
-@startuml
+```mermaid
+sequenceDiagram
+    participant Client
+    participant FlaskServer as "Flask Server"
+    participant Microservice
 
-title UML Sequence Diagram: Requesting and Receiving Data
-
-participant Client
-participant "Flask Server" as FlaskServer
-participant Microservice
-
-Client -> FlaskServer: POST /extract_ids\nJSON Payload
-FlaskServer -> Microservice: Forward Request
-activate Microservice
-Note over Microservice: Processing Request\nExtracting IDs
-Microservice -> Microservice: Access JSON Data
-Note over Microservice: Data Extraction
-Microservice --> FlaskServer: JSON Response
-deactivate Microservice
-FlaskServer --> Client: HTTP Response with JSON Data
-
-@enduml
+    Client->>FlaskServer: POST /extract_ids\nJSON Payload
+    FlaskServer->>Microservice: Forward Request
+    Note over Microservice: Processing Request\nExtracting IDs
+    Microservice->>Microservice: Access JSON Data
+    Note over Microservice: Data Extraction
+    Microservice-->>FlaskServer: JSON Response
+    FlaskServer-->>Client: HTTP Response with JSON Data
 ```
